#include <fstream> // библиотеки, но я уже не помню что к чему
#include <iostream>
#include <cstdio>
using namespace std; // просто надо


int main()
{
	setlocale(LC_ALL, "rus"); // русик

	int i = 0; // счетчик массива
	int j = 0; // счетчик совпадений
	int q = 0; // счетчик символов в первой строке
	int e = 0; // счетчик символов во второй строке

	char stroka1[10]; // массив 1 строки
	cout << "Введите первую строку: "; // ввод 1 строки
	gets_s(stroka1); // считывание 1 строки
	char stroka2[10]; // массив 2 строки
	cout << "Введите вторую строку: "; // ввод 2 строки
	gets_s(stroka2); // считывание 2 строки

	while (stroka1[q] != '\0') // подсчет символов в 1 строке
	{
		q ++;
	}

	while (stroka2[e] != '\0') // подсчет символов во 2 строке
	{
		e ++;
	}

	if (q > e) // выбор меньшего значения
	{
		q = e;
	}
	else 
	{
		e = q;
	}

	for (i = 0; i < 9; i++) // подсчет совпадений
	{
		if (stroka1[i] == stroka2[i])
		{
			j ++;
		}
		else {
			j--;
		}
	}
	if (j  > q) // вывод
	{
		cout << " Массивы равны ";
	}
	else
	{
		cout << " Массивы не равны ";
	}
	system("pause"); // шоб окошко сразу не закрывалось
	return 0; // повторялка
}